nala.org
#+TITLE: Nala Loom: DotCortex
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Nala/apt manifest
Columns: PKG, VERSION, CATEGORY, SCOPE, EXTRA
- VERSION: empty means latest from apt
- CATEGORY: documentation grouping (bootstrap, cli, desktop, xfce, fonts, media, dev, network, system, gaming, third-party)
- SCOPE: =shared= (all Debian-family), =devuan-only=, =ubuntu-only=
- EXTRA: reserved

#+BEGIN_SRC text :tangle debian/.nala/manifest/packages.ssv :padline no :comments none
# PKG VERSION CATEGORY SCOPE EXTRA
# Captured: 2026-03-18 from Devuan Excalibur T480s + Ubuntu Jammy X230 reference

# --- Bootstrap (also in INSTALL.sh, duplicated here for standalone nala:apply) ---
git "" bootstrap shared ""
stow "" bootstrap shared ""
curl "" bootstrap shared ""
wget "" bootstrap shared ""
make "" bootstrap shared ""
build-essential "" bootstrap shared ""
emacs-nox "" bootstrap shared ""
python3 "" bootstrap shared ""
python3-pip "" bootstrap shared ""
python3-venv "" bootstrap shared ""
nodejs "" bootstrap shared ""
# npm provided by nodesource nodejs or Guix — system npm conflicts with nodesource
keychain "" bootstrap shared ""
jq "" bootstrap shared ""
tree "" bootstrap shared ""
rsync "" bootstrap shared ""
htop "" bootstrap shared ""
pkg-config "" bootstrap shared ""
libssl-dev "" bootstrap shared ""
libfreetype-dev "" bootstrap shared ""
libfontconfig-dev "" bootstrap shared ""

# --- CLI Tools ---
dialog "" cli shared ""
fzf "" cli shared ""
lsof "" cli shared ""
lynx "" cli shared ""
mc "" cli shared ""
meld "" cli shared ""
rename "" cli shared ""
screen "" cli shared ""
trash-cli "" cli shared ""
xclip "" cli shared ""
xdotool "" cli shared ""
xmlstarlet "" cli shared ""
detox "" cli shared ""
jdupes "" cli shared ""
rdfind "" cli shared ""
plocate "" cli shared ""
vim "" cli shared ""

# --- Desktop Apps ---
gparted "" desktop shared ""
kdeconnect "" desktop shared ""
plank "" desktop shared ""
yad "" desktop shared ""
deskflow "" desktop shared ""
font-manager "" desktop shared ""
grsync "" desktop shared ""
gthumb "" desktop shared ""
seahorse "" desktop shared ""
picom "" desktop shared ""
pluma "" desktop shared ""

# --- XFCE Plugins ---
xfce4-appmenu-plugin "" xfce shared ""
xfce4-clipman-plugin "" xfce shared ""
xfce4-cpugraph-plugin "" xfce shared ""
xfce4-docklike-plugin "" xfce shared ""
xfce4-pulseaudio-plugin "" xfce shared ""
xfce4-systemload-plugin "" xfce shared ""
xfce4-verve-plugin "" xfce shared ""
xfce4-weather-plugin "" xfce shared ""
xfce4-whiskermenu-plugin "" xfce shared ""
xfce4-xkb-plugin "" xfce shared ""

# --- Fonts ---
fonts-noto-color-emoji "" fonts shared ""
fonts-powerline "" fonts shared ""
fonts-unfonts-core "" fonts shared ""

# --- Media ---
ffmpeg "" media shared ""
flac "" media shared ""
sox "" media shared ""
shntool "" media shared ""
cuetools "" media shared ""

# --- Dev Libraries (build deps for Cargo, WezTerm, etc) ---
libssl-dev "" dev shared ""
libfreetype-dev "" dev shared ""
libfontconfig-dev "" dev shared ""
libfontconfig1-dev "" dev shared ""
libsdl2-dev "" dev shared ""
libgtk-3-dev "" dev shared ""
libglib2.0-dev "" dev shared ""
gettext "" dev shared ""
python3-dev "" dev shared ""
python3-setuptools "" dev shared ""
cmake "" dev shared ""
autoconf "" dev shared ""
automake "" dev shared ""
libtool "" dev shared ""
bison "" dev shared ""
flex "" dev shared ""
texinfo "" dev shared ""

# --- System ---
libfuse2t64 "" system shared ""
daemonize "" system devuan-only ""
earlyoom "" system shared ""
smartmontools "" system shared ""
flatpak "" system shared ""
gnome-software-plugin-flatpak "" system shared ""
fastfetch "" system shared ""
sshfs "" system shared ""
nfs-common "" system shared ""
joystick "" system shared ""
evtest "" system shared ""
xinput "" system shared ""

# --- Network ---
samba "" network shared ""

# --- Third-party (require repos from repos.ssv) ---
signal-desktop "" third-party shared ""
brave-browser "" third-party shared ""
antigravity "" third-party shared ""

# --- Ubuntu-only ---
ubuntu-restricted-addons "" system ubuntu-only ""
ppa-purge "" system ubuntu-only ""
zram-tools "" system ubuntu-only ""
#+END_SRC

* Third-party repos manifest
Columns: NAME, TYPE, KEY_URL, REPO_SPEC, OS_MATCH, EXTRA
- TYPE: =key+sources= (GPG key + .sources file), =key+list= (GPG key + .list file), =ppa= (Ubuntu PPA)
- OS_MATCH: =all=, =devuan=, =ubuntu=

#+BEGIN_SRC text :tangle debian/.nala/manifest/repos.ssv :padline no :comments none
# NAME TYPE KEY_URL REPO_SPEC OS_MATCH EXTRA
signal-desktop key+sources "https://updates.signal.org/desktop/apt/keys.asc" "https://updates.signal.org/static/desktop/apt/signal-desktop.sources" all ""
brave-browser-release key+sources "https://brave-browser-apt-release.s3.brave.com/brave-browser-archive-keyring.gpg" "https://brave-browser-apt-release.s3.brave.com/brave-browser-release.sources" all ""
antigravity key+list "https://us-central1-apt.pkg.dev/doc/repo-signing-key.gpg" "deb [signed-by=/etc/apt/keyrings/antigravity-repo-key.gpg] https://us-central1-apt.pkg.dev/projects/antigravity-auto-updater-dev/ antigravity-debian main" all "/etc/apt/keyrings/antigravity-repo-key.gpg"
#+END_SRC

* Repos setup script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-repos-setup :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_REPOS_SSV:-$HOME/.nala/manifest/repos.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No repos manifest at $MAN" >&2
  exit 0
fi

# Detect OS
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

scope_matches() {
  local scope="$1"
  case "$scope" in
    all) return 0 ;;
    devuan) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

CHANGED=0

parse_repo_line() {
  local line="$1"
  local -a parts=()

  mapfile -t parts < <(printf '%s\n' "$line" | xargs -n1 printf '%s\n')
  while [ "${#parts[@]}" -lt 6 ]; do
    parts+=("")
  done
  printf '%s|%s|%s|%s|%s|%s\n' \
    "${parts[0]}" "${parts[1]}" "${parts[2]}" \
    "${parts[3]}" "${parts[4]}" "${parts[5]}"
}

while IFS='|' read -r name type key_url repo_spec os_match _extra; do
  [ -z "$name" ] && continue

  if ! scope_matches "$os_match"; then
    echo "  skip $name (os=$os_match, this=$OS_ID)"
    continue
  fi

  case "$type" in
    key+sources)
      # key_url is GPG key, repo_spec is URL to .sources file
      keyring="/usr/share/keyrings/${name}-keyring.gpg"
      sources_file="/etc/apt/sources.list.d/${name}.sources"

      if [ -f "$sources_file" ]; then
        echo "  ok $name (already configured)"
        continue
      fi

      echo "  add $name repo..."

      # Download and install key
      if [ -n "$key_url" ]; then
        if echo "$key_url" | grep -q '\.gpg$'; then
          sudo wget -qO "$keyring" "$key_url"
        else
          wget -qO- "$key_url" | gpg --dearmor | sudo tee "$keyring" >/dev/null
        fi
      fi

      # Download and install sources file
      sudo wget -qO "$sources_file" "$repo_spec"
      CHANGED=1
      echo "  done $name"
      ;;

    ppa)
      # Ubuntu PPA — repo_spec is the PPA string
      if [ "$OS_ID" != "ubuntu" ]; then
        echo "  skip $name (PPA, not Ubuntu)"
        continue
      fi
      if grep -rq "$repo_spec" /etc/apt/sources.list.d/ 2>/dev/null; then
        echo "  ok $name (already configured)"
        continue
      fi
      echo "  add $name PPA..."
      sudo add-apt-repository -y "ppa:$repo_spec"
      CHANGED=1
      ;;

    key+list)
      keyring="${_extra:-}"
      [ -n "$keyring" ] || keyring="/usr/share/keyrings/${name}-keyring.gpg"
      list_file="/etc/apt/sources.list.d/${name}.list"

      if [ -f "$list_file" ] && grep -Fqx "$repo_spec" "$list_file" 2>/dev/null; then
        echo "  ok $name (already configured)"
        continue
      fi

      echo "  add $name repo..."
      sudo mkdir -p "$(dirname "$keyring")"

      if [ -n "$key_url" ]; then
        if echo "$key_url" | grep -q '\.gpg$'; then
          sudo wget -qO "$keyring" "$key_url"
        else
          wget -qO- "$key_url" | gpg --dearmor --yes | sudo tee "$keyring" >/dev/null
        fi
      fi

      printf '%s\n' "$repo_spec" | sudo tee "$list_file" >/dev/null
      CHANGED=1
      ;;

    *)
      echo "  unknown repo type: $type for $name" >&2
      ;;
  esac
done < <(
  while IFS= read -r raw; do
    line="${raw#${raw%%[![:space:]]*}}"
    line="${line%${line##*[![:space:]]}}"
    [ -z "$line" ] && continue
    case "$line" in
      \#*) continue ;;
    esac
    parse_repo_line "$line"
  done < "$MAN"
)

if [ "$CHANGED" -eq 1 ]; then
  echo "Repos changed, updating package lists..."
  APT="apt-get"
  command -v nala &>/dev/null && APT="nala"
  sudo $APT update -y
fi
#+END_SRC

* Apply script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-apply :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"
ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-0}"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN" >&2
  exit 1
fi

# --- Detect OS ---
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

scope_matches() {
  local scope="$1"
  case "$scope" in
    shared) return 0 ;;
    devuan-only) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu-only) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

# --- Bootstrap nala if missing ---
APT="apt-get"
if command -v nala &>/dev/null; then
  APT="nala"
else
  echo "nala not found, installing..."
  sudo apt-get update -y
  sudo apt-get install -y nala || {
    echo "nala install failed, falling back to apt-get"
    APT="apt-get"
  }
  command -v nala &>/dev/null && APT="nala"
fi
echo "Using: $APT"

# --- Parse manifest, filter by scope ---
INSTALL_LIST=()

while IFS='|' read -r pkg _ver _cat scope _extra; do
  [ -z "$pkg" ] && continue

  if ! scope_matches "$scope"; then
    continue
  fi

  # Check if already installed
  if dpkg -s "$pkg" &>/dev/null 2>&1; then
    continue
  fi

  # Check if package exists in repos
  if ! apt-cache show "$pkg" &>/dev/null 2>&1; then
    echo "Error: $pkg not found" >&2
    continue
  fi

  INSTALL_LIST+=("$pkg")
done < <(
  awk -v FS='[ \t]+' '
    function dq(s){ return (s == "\"\"" ? "" : s) }
    /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s\n",
        dq($1), dq($2), dq($3), dq($4), dq($5)
    }
  ' "$MAN"
)

# --- Install missing ---
if [ ${#INSTALL_LIST[@]} -eq 0 ]; then
  echo "All manifest packages are installed."
else
  echo "Installing ${#INSTALL_LIST[@]} packages..."
  printf "  %s\n" "${INSTALL_LIST[@]}"
  sudo $APT install -y "${INSTALL_LIST[@]}" || {
    if [ "$APT" = "nala" ]; then
      echo "nala failed (broken resolver), falling back to apt-get..."
      sudo apt-get install -y "${INSTALL_LIST[@]}"
    else
      exit 1
    fi
  }
fi

echo "Done."
#+END_SRC

