debian/.local/bin/nala-repos-setup
#!/usr/bin/env bash
# Repos setup script

# [[file:../../../nala.org::*Repos setup script][Repos setup script:1]]
set -euo pipefail

MAN="${NALA_REPOS_SSV:-$HOME/.nala/manifest/repos.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No repos manifest at $MAN" >&2
  exit 0
fi

# Detect OS
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

scope_matches() {
  local scope="$1"
  case "$scope" in
    all) return 0 ;;
    devuan) [ "$IS_DEVUAN" -eq 1 ] ;;
    ubuntu) [ "$OS_ID" = "ubuntu" ] ;;
    *) return 0 ;;
  esac
}

CHANGED=0

parse_repo_line() {
  local line="$1"
  local -a parts=()

  mapfile -t parts < <(printf '%s\n' "$line" | xargs -n1 printf '%s\n')
  while [ "${#parts[@]}" -lt 6 ]; do
    parts+=("")
  done
  printf '%s|%s|%s|%s|%s|%s\n' \
    "${parts[0]}" "${parts[1]}" "${parts[2]}" \
    "${parts[3]}" "${parts[4]}" "${parts[5]}"
}

while IFS='|' read -r name type key_url repo_spec os_match _extra; do
  [ -z "$name" ] && continue

  if ! scope_matches "$os_match"; then
    echo "  skip $name (os=$os_match, this=$OS_ID)"
    continue
  fi

  case "$type" in
    key+sources)
      # key_url is GPG key, repo_spec is URL to .sources file
      keyring="/usr/share/keyrings/${name}-keyring.gpg"
      sources_file="/etc/apt/sources.list.d/${name}.sources"

      if [ -f "$sources_file" ]; then
        echo "  ok $name (already configured)"
        continue
      fi

      echo "  add $name repo..."

      # Download and install key
      if [ -n "$key_url" ]; then
        if echo "$key_url" | grep -q '\.gpg$'; then
          sudo wget -qO "$keyring" "$key_url"
        else
          wget -qO- "$key_url" | gpg --dearmor | sudo tee "$keyring" >/dev/null
        fi
      fi

      # Download and install sources file
      sudo wget -qO "$sources_file" "$repo_spec"
      CHANGED=1
      echo "  done $name"
      ;;

    ppa)
      # Ubuntu PPA — repo_spec is the PPA string
      if [ "$OS_ID" != "ubuntu" ]; then
        echo "  skip $name (PPA, not Ubuntu)"
        continue
      fi
      if grep -rq "$repo_spec" /etc/apt/sources.list.d/ 2>/dev/null; then
        echo "  ok $name (already configured)"
        continue
      fi
      echo "  add $name PPA..."
      sudo add-apt-repository -y "ppa:$repo_spec"
      CHANGED=1
      ;;

    key+list)
      keyring="${_extra:-}"
      [ -n "$keyring" ] || keyring="/usr/share/keyrings/${name}-keyring.gpg"
      list_file="/etc/apt/sources.list.d/${name}.list"

      if [ -f "$list_file" ] && grep -Fqx "$repo_spec" "$list_file" 2>/dev/null; then
        echo "  ok $name (already configured)"
        continue
      fi

      echo "  add $name repo..."
      sudo mkdir -p "$(dirname "$keyring")"

      if [ -n "$key_url" ]; then
        if echo "$key_url" | grep -q '\.gpg$'; then
          sudo wget -qO "$keyring" "$key_url"
        else
          wget -qO- "$key_url" | gpg --dearmor --yes | sudo tee "$keyring" >/dev/null
        fi
      fi

      printf '%s\n' "$repo_spec" | sudo tee "$list_file" >/dev/null
      CHANGED=1
      ;;

    *)
      echo "  unknown repo type: $type for $name" >&2
      ;;
  esac
done < <(
  while IFS= read -r raw; do
    line="${raw#${raw%%[![:space:]]*}}"
    line="${line%${line##*[![:space:]]}}"
    [ -z "$line" ] && continue
    case "$line" in
      \#*) continue ;;
    esac
    parse_repo_line "$line"
  done < "$MAN"
)

if [ "$CHANGED" -eq 1 ]; then
  echo "Repos changed, updating package lists..."
  APT="apt-get"
  command -v nala &>/dev/null && APT="nala"
  sudo $APT update -y
fi
# Repos setup script:1 ends here
