nala.org
* Antigravity settings, Linux
#+BEGIN_SRC json :tangle linux/.config/Antigravity/User/settings.json :mkdirp yes :comments no
{
  "claudeCode.preferredLocation": "panel",

  "terminal.integrated.commandsToSkipShell": [
    "workbench.action.terminal.sendSequence"
  ],

  "terminal.integrated.profiles.linux": {
    "Guix zsh (sandbox)": {
      "path": "/bin/sh",
      "args": ["-lc", "exec \"$HOME/.guix-extra-profiles/core/core/bin/zsh\" -l"],
      "overrideName": true
    },
    "Guix zsh (host)": {
      "path": "/usr/bin/flatpak-spawn",
      "args": ["--host", "/bin/sh", "-lc", "exec \"$HOME/.guix-extra-profiles/core/core/bin/zsh\" -l"],
      "overrideName": true
    }
  },
  "terminal.integrated.defaultProfile.linux": "Guix zsh (host)",
  "terminal.integrated.inheritEnv": false,

  "vim.enable": true,
  "vim.useSystemClipboard": true
}
#+END_SRC

#+BEGIN_SRC json :tangle linux/.config/Antigravity/User/keybindings.json :mkdirp yes :comments no
[
  {
    "key": "shift+enter",
    "command": "-workbench.action.terminal.sendSequence",
    "when": "terminalFocus"
  },
  {
    "key": "shift+enter",
    "command": "workbench.action.terminal.sendSequence",
    "args": {
      "text": "\u001b\u000d"
    },
    "when": "terminalFocus"
  }
]
#+END_SRC

* Diff script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-diff :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN" >&2
  exit 1
fi

# --- Detect OS ---
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

# --- Extract wanted packages (filtered by scope) ---
wanted_tmp="$(mktemp)"
trap 'rm -f "$wanted_tmp"' EXIT

awk -v FS='[ \t]+' -v is_devuan="$IS_DEVUAN" -v os_id="$OS_ID" '
  function dq(s){ return (s == "\"\"" ? "" : s) }
  /^[ \t]*#/ || NF==0 { next }
  {
    pkg = dq($1)
    scope = dq($4)
    if (scope == "shared") print pkg
    else if (scope == "devuan-only" && is_devuan == 1) print pkg
    else if (scope == "ubuntu-only" && os_id == "ubuntu") print pkg
  }
' "$MAN" | sort -u > "$wanted_tmp"

# --- Get installed manual packages ---
have_tmp="$(mktemp)"
trap 'rm -f "$wanted_tmp" "$have_tmp"' EXIT

dpkg-query -W -f='${Package}\n' | sort -u > "$have_tmp"

# --- Diff ---
to_install="$(comm -23 "$wanted_tmp" "$have_tmp")"
# Show manually installed that aren't in manifest (informational only)

echo "=== nala:diff ==="
echo

if [ -n "$to_install" ]; then
  count=$(echo "$to_install" | wc -l)
  echo "[to install] ($count packages)"
  echo "$to_install" | sed 's/^/  + /'
else
  echo "[to install] (none)"
fi

echo
echo "Manifest: $(wc -l < "$wanted_tmp") packages for this OS"
echo "Installed: $(wc -l < "$have_tmp") total dpkg packages"
#+END_SRC

* Capture script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-capture :shebang "#!/usr/bin/env bash"
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN — creating with header" >&2
  mkdir -p "$(dirname "$MAN")"
  echo '# PKG VERSION CATEGORY SCOPE EXTRA' > "$MAN"
fi

# Get packages already in manifest
existing_tmp="$(mktemp)"
trap 'rm -f "$existing_tmp"' EXIT
awk -v FS='[ \t]+' '!/^[ \t]*#/ && NF { print $1 }' "$MAN" | sort -u > "$existing_tmp"

# Get manually installed packages
manual_tmp="$(mktemp)"
trap 'rm -f "$existing_tmp" "$manual_tmp"' EXIT
apt-mark showmanual | sort -u > "$manual_tmp"

# Find new (manually installed but not in manifest)
new_pkgs="$(comm -23 "$manual_tmp" "$existing_tmp")"

if [ -z "$new_pkgs" ]; then
  echo "No new manually-installed packages to capture."
  exit 0
fi

count=$(echo "$new_pkgs" | wc -l)
echo "Found $count new manually-installed packages:"
echo "$new_pkgs" | sed 's/^/  /'
echo

echo "Appending to $MAN with category=uncategorized scope=shared"
echo "" >> "$MAN"
echo "# --- Captured $(date +%Y-%m-%d) ---" >> "$MAN"
while IFS= read -r pkg; do
  printf '%s "" uncategorized shared ""\n' "$pkg" >> "$MAN"
done <<< "$new_pkgs"

echo "Done. Review and recategorize in nala.org."
#+END_SRC

* Health script
#+BEGIN_SRC bash :tangle debian/.local/bin/nala-health :shebang "#!/usr/bin/env bash"
set -euo pipefail

echo "=== nala:health ==="
echo

# OS info
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  echo "OS:    $PRETTY_NAME"
fi
[ -f /etc/devuan_version ] && echo "Init:  sysvinit (Devuan $(cat /etc/devuan_version))"

# Package manager
if command -v nala &>/dev/null; then
  echo "Nala:  $(nala --version 2>&1 | head -1)"
else
  echo "Nala:  not installed (will use apt-get)"
fi
echo "Apt:   $(apt-get --version | head -1)"

# Counts
MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"
if [ -f "$MAN" ]; then
  manifest_count=$(awk -v FS='[ \t]+' '!/^[ \t]*#/ && NF { c++ } END { print c+0 }' "$MAN")
  echo "SSV:   $manifest_count packages in manifest"
else
  echo "SSV:   no manifest found at $MAN"
fi

installed_count=$(dpkg-query -W -f='x\n' | wc -l)
manual_count=$(apt-mark showmanual | wc -l)
echo "Dpkg:  $installed_count installed, $manual_count manual"

# Third-party repos
repo_count=$(ls /etc/apt/sources.list.d/ 2>/dev/null | wc -l)
echo "Repos: $repo_count in sources.list.d/"
ls /etc/apt/sources.list.d/ 2>/dev/null | sed 's/^/  /'
#+END_SRC

* Make targets
#+BEGIN_SRC makefile :tangle all/.mk/nala.mk :padline no :comments none
# Nala/apt Make targets fragment. Requires GNU Make 3.82+.
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: nala-repos nala-capture nala-diff nala-sync nala-apply nala-health

nala-repos:
| @chmod +x $(HOME)/.local/bin/nala-repos-setup 2>/dev/null || true
| $(HOME)/.local/bin/nala-repos-setup

nala-capture:
| @chmod +x $(HOME)/.local/bin/nala-capture 2>/dev/null || true
| $(HOME)/.local/bin/nala-capture

nala-diff:
| @chmod +x $(HOME)/.local/bin/nala-diff 2>/dev/null || true
| $(HOME)/.local/bin/nala-diff

nala-sync: nala-repos
| @chmod +x $(HOME)/.local/bin/nala-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 $(HOME)/.local/bin/nala-apply

nala-apply: nala-repos
| @chmod +x $(HOME)/.local/bin/nala-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=0 $(HOME)/.local/bin/nala-apply

nala-health:
| @chmod +x $(HOME)/.local/bin/nala-health 2>/dev/null || true
| $(HOME)/.local/bin/nala-health
#+END_SRC

* Old Ubuntu X230 reference
This is the raw dump from Ubuntu 22.04 Jammy on the X230. Kept for reference when deciding what to add to the manifest above.
Not tangled — documentation only.

