debian/.local/bin/nala-capture
#!/usr/bin/env bash
# Capture script

# [[file:../../../nala.org::*Capture script][Capture script:1]]
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN — creating with header" >&2
  mkdir -p "$(dirname "$MAN")"
  echo '# PKG VERSION CATEGORY SCOPE EXTRA' > "$MAN"
fi

# Get packages already in manifest
existing_tmp="$(mktemp)"
trap 'rm -f "$existing_tmp"' EXIT
awk -v FS='[ \t]+' '!/^[ \t]*#/ && NF { print $1 }' "$MAN" | sort -u > "$existing_tmp"

# Get manually installed packages
manual_tmp="$(mktemp)"
trap 'rm -f "$existing_tmp" "$manual_tmp"' EXIT
apt-mark showmanual | sort -u > "$manual_tmp"

# Find new (manually installed but not in manifest)
new_pkgs="$(comm -23 "$manual_tmp" "$existing_tmp")"

if [ -z "$new_pkgs" ]; then
  echo "No new manually-installed packages to capture."
  exit 0
fi

count=$(echo "$new_pkgs" | wc -l)
echo "Found $count new manually-installed packages:"
echo "$new_pkgs" | sed 's/^/  /'
echo

echo "Appending to $MAN with category=uncategorized scope=shared"
echo "" >> "$MAN"
echo "# --- Captured $(date +%Y-%m-%d) ---" >> "$MAN"
while IFS= read -r pkg; do
  printf '%s "" uncategorized shared ""\n' "$pkg" >> "$MAN"
done <<< "$new_pkgs"

echo "Done. Review and recategorize in nala.org."
# Capture script:1 ends here
