debian/.local/bin/nala-diff
#!/usr/bin/env bash
# Diff script

# [[file:../../../nala.org::*Diff script][Diff script:1]]
set -euo pipefail

MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"

if [ ! -f "$MAN" ]; then
  echo "No manifest at $MAN" >&2
  exit 1
fi

# --- Detect OS ---
OS_ID="unknown"
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  OS_ID="$ID"
fi
IS_DEVUAN=0
[ -f /etc/devuan_version ] && IS_DEVUAN=1

# --- Extract wanted packages (filtered by scope) ---
wanted_tmp="$(mktemp)"
trap 'rm -f "$wanted_tmp"' EXIT

awk -v FS='[ \t]+' -v is_devuan="$IS_DEVUAN" -v os_id="$OS_ID" '
  function dq(s){ return (s == "\"\"" ? "" : s) }
  /^[ \t]*#/ || NF==0 { next }
  {
    pkg = dq($1)
    scope = dq($4)
    if (scope == "shared") print pkg
    else if (scope == "devuan-only" && is_devuan == 1) print pkg
    else if (scope == "ubuntu-only" && os_id == "ubuntu") print pkg
  }
' "$MAN" | sort -u > "$wanted_tmp"

# --- Get installed manual packages ---
have_tmp="$(mktemp)"
trap 'rm -f "$wanted_tmp" "$have_tmp"' EXIT

dpkg-query -W -f='${Package}\n' | sort -u > "$have_tmp"

# --- Diff ---
to_install="$(comm -23 "$wanted_tmp" "$have_tmp")"
# Show manually installed that aren't in manifest (informational only)

echo "=== nala:diff ==="
echo

if [ -n "$to_install" ]; then
  count=$(echo "$to_install" | wc -l)
  echo "[to install] ($count packages)"
  echo "$to_install" | sed 's/^/  + /'
else
  echo "[to install] (none)"
fi

echo
echo "Manifest: $(wc -l < "$wanted_tmp") packages for this OS"
echo "Installed: $(wc -l < "$have_tmp") total dpkg packages"
# Diff script:1 ends here
