debian/.local/bin/nala-health
#!/usr/bin/env bash
# Health script

# [[file:../../../nala.org::*Health script][Health script:1]]
set -euo pipefail

echo "=== nala:health ==="
echo

# OS info
if [ -f /etc/os-release ]; then
  # shellcheck disable=SC1091
  . /etc/os-release
  echo "OS:    $PRETTY_NAME"
fi
[ -f /etc/devuan_version ] && echo "Init:  sysvinit (Devuan $(cat /etc/devuan_version))"

# Package manager
if command -v nala &>/dev/null; then
  echo "Nala:  $(nala --version 2>&1 | head -1)"
else
  echo "Nala:  not installed (will use apt-get)"
fi
echo "Apt:   $(apt-get --version | head -1)"

# Counts
MAN="${NALA_SSV:-$HOME/.nala/manifest/packages.ssv}"
if [ -f "$MAN" ]; then
  manifest_count=$(awk -v FS='[ \t]+' '!/^[ \t]*#/ && NF { c++ } END { print c+0 }' "$MAN")
  echo "SSV:   $manifest_count packages in manifest"
else
  echo "SSV:   no manifest found at $MAN"
fi

installed_count=$(dpkg-query -W -f='x\n' | wc -l)
manual_count=$(apt-mark showmanual | wc -l)
echo "Dpkg:  $installed_count installed, $manual_count manual"

# Third-party repos
repo_count=$(ls /etc/apt/sources.list.d/ 2>/dev/null | wc -l)
echo "Repos: $repo_count in sources.list.d/"
ls /etc/apt/sources.list.d/ 2>/dev/null | sed 's/^/  /'
# Health script:1 ends here
